# PANDAS

In [3]:
import numpy as np
import pandas as pd

## 1 - Series

In [9]:
benimSozlugum = {"can":20, "Ayben":18, "Mehmet":16}
pdSozluk = pd.Series(benimSozlugum)
pdSozluk

can       20
Ayben     18
Mehmet    16
dtype: int64

In [10]:
type(pdSozluk)

pandas.core.series.Series

In [12]:
yaslar = [20,18,16]
isimler = ["Can","Ayben","Mehmet"]
pdSozluk2 = pd.Series(data=yaslar,index=isimler) #pd.Series(yaslar,isimler) ile aynidir
pdSozluk2

Can       20
Ayben     18
Mehmet    16
dtype: int64

In [13]:
npYaslar = np.array([20,18,16])
pdSozluk3 = pd.Series(npYaslar, isimler)
pdSozluk3

Can       20
Ayben     18
Mehmet    16
dtype: int32

## 2 - Attributes of Series

In [16]:
pd.Series(["Can","Ayben","Mehmet"],[1,2,3]) # burada data isimler, indexler sayi oldu yukaridan farkli olarak

1       Can
2     Ayben
3    Mehmet
dtype: object

In [23]:
yarismaSonuc = pd.Series([25,21,555],["Can","Ayben","Mehmet"])
yarismaSonuc

Can        25
Ayben      21
Mehmet    555
dtype: int64

In [19]:
yarismaSonuc["Can"]

25

In [24]:
yarismaSonuc2 = pd.Series([10,20,5],["Can","Ayben","Mehmet"])
yarismaSonuc2

Can       10
Ayben     20
Mehmet     5
dtype: int64

In [26]:
sonSonuc = yarismaSonuc2 + yarismaSonuc # ayni indexleri topladi 
sonSonuc

Can        35
Ayben      41
Mehmet    560
dtype: int64

In [31]:
yarismaSonuc3 = pd.Series([25,21,555],["Can","Mehmet","Ayben"])
yarismaSonuc4 = pd.Series([10,20,5],["Can","Kemal","Sabri"])
sonSonuc2 = yarismaSonuc4 + yarismaSonuc3 # sadece indexini bulabilgini topluyor ve digerlerine NaN atar
sonSonuc2

Ayben      NaN
Can       35.0
Kemal      NaN
Mehmet     NaN
Sabri      NaN
dtype: float64

## 3 - Data Frame

In [33]:
data = np.random.randn(4,3)
data

array([[ 0.57305659,  0.83479188,  0.57209178],
       [-0.20578754,  0.53728782, -1.3988979 ],
       [ 1.20047051, -1.61570771, -1.4150315 ],
       [-0.74142832,  1.34398984,  0.7266445 ]])

In [34]:
dataFrame = pd.DataFrame(data)
dataFrame

          0         1         2
0  0.573057  0.834792  0.572092
1 -0.205788  0.537288 -1.398898
2  1.200471 -1.615708 -1.415032
3 -0.741428  1.343990  0.726644

In [36]:
print(type(dataFrame[0]))
dataFrame[0]

<class 'pandas.core.series.Series'>

0    0.573057
1   -0.205788
2    1.200471
3   -0.741428
Name: 0, dtype: float64

In [39]:
newDataFrame = pd.DataFrame(data, index=["Can","Ayben","Mehmet","Ali"], columns=["1. sinav","2. sinav","3. sinav"])
newDataFrame

        1. sinav  2. sinav  3. sinav
Can     0.573057  0.834792  0.572092
Ayben  -0.205788  0.537288 -1.398898
Mehmet  1.200471 -1.615708 -1.415032
Ali    -0.741428  1.343990  0.726644

In [40]:
newDataFrame["2. sinav"]

Can       0.834792
Ayben     0.537288
Mehmet   -1.615708
Ali       1.343990
Name: 2. sinav, dtype: float64

In [51]:
newDataFrame[["1. sinav","2. sinav"]]

        1. sinav  2. sinav
Can     0.573057  0.834792
Ayben  -0.205788  0.537288
Mehmet  1.200471 -1.615708
Ali    -0.741428  1.343990

In [52]:
newDataFrame.loc["Ayben"] # location

1. sinav   -0.205788
2. sinav    0.537288
3. sinav   -1.398898
Name: Ayben, dtype: float64

In [53]:
newDataFrame.iloc[1] # index location

1. sinav   -0.205788
2. sinav    0.537288
3. sinav   -1.398898
Name: Ayben, dtype: float64

## 4 - Data Frame Indexing

In [55]:
newDataFrame

        1. sinav  2. sinav  3. sinav
Can     0.573057  0.834792  0.572092
Ayben  -0.205788  0.537288 -1.398898
Mehmet  1.200471 -1.615708 -1.415032
Ali    -0.741428  1.343990  0.726644

In [56]:
ortalama = pd.Series(index= newDataFrame.index, data=(newDataFrame["2. sinav"]+newDataFrame["1. sinav"]+newDataFrame["3. sinav"])/3)
ortalama

Can       0.659980
Ayben    -0.355799
Mehmet   -0.610090
Ali       0.443069
dtype: float64

In [57]:
newDataFrame["ortalama"] = ortalama
newDataFrame

        1. sinav  2. sinav  3. sinav  ortalama
Can     0.573057  0.834792  0.572092  0.659980
Ayben  -0.205788  0.537288 -1.398898 -0.355799
Mehmet  1.200471 -1.615708 -1.415032 -0.610090
Ali    -0.741428  1.343990  0.726644  0.443069

In [77]:
newDataFrame["carpma"] = newDataFrame["2. sinav"] * newDataFrame["3. sinav"]
newDataFrame

        1. sinav  2. sinav  3. sinav  ortalama    carpma
Can     0.573057  0.834792  0.572092  0.659980  0.477578
Ayben  -0.205788  0.537288 -1.398898 -0.355799 -0.751611
Mehmet  1.200471 -1.615708 -1.415032 -0.610090  2.286277
Ali    -0.741428  1.343990  0.726644  0.443069  0.976603

In [72]:
newDataFrame.drop("carpma", axis=1)

        1. sinav  2. sinav  3. sinav  ortalama
Can     0.573057  0.834792  0.572092  0.659980
Ayben  -0.205788  0.537288 -1.398898 -0.355799
Mehmet  1.200471 -1.615708 -1.415032 -0.610090
Ali    -0.741428  1.343990  0.726644  0.443069

In [63]:
newDataFrame.drop("Mehmet", axis=0)

       1. sinav  2. sinav  3. sinav  ortalama    carpma
Can    0.573057  0.834792  0.572092  0.659980  0.477578
Ayben -0.205788  0.537288 -1.398898 -0.355799 -0.751611
Ali   -0.741428  1.343990  0.726644  0.443069  0.976603

In [73]:
newDataFrame # eger kaydedilmesini belirtmezsek kaydetmez

        1. sinav  2. sinav  3. sinav  ortalama    carpma
Can     0.573057  0.834792  0.572092  0.659980  0.477578
Ayben  -0.205788  0.537288 -1.398898 -0.355799 -0.751611
Mehmet  1.200471 -1.615708 -1.415032 -0.610090  2.286277
Ali    -0.741428  1.343990  0.726644  0.443069  0.976603

In [78]:
newDataFrame.drop("carpma", axis=1, inplace=True) # inplace kaydetmeye yarar
newDataFrame

        1. sinav  2. sinav  3. sinav  ortalama
Can     0.573057  0.834792  0.572092  0.659980
Ayben  -0.205788  0.537288 -1.398898 -0.355799
Mehmet  1.200471 -1.615708 -1.415032 -0.610090
Ali    -0.741428  1.343990  0.726644  0.443069

In [81]:
newDataFrame.loc["Can"]

1. sinav    0.573057
2. sinav    0.834792
3. sinav    0.572092
ortalama    0.659980
Name: Can, dtype: float64

In [83]:
newDataFrame.loc["Can"]["1. sinav"]

0.5730565912797857

In [85]:
newDataFrame.loc["Can","1. sinav"]

0.5730565912797857

In [87]:
booleanFrame = newDataFrame < 0

In [88]:
booleanFrame

        1. sinav  2. sinav  3. sinav  ortalama
Can        False     False     False     False
Ayben       True     False      True      True
Mehmet     False      True      True      True
Ali         True     False     False     False

In [89]:
newDataFrame[booleanFrame]

        1. sinav  2. sinav  3. sinav  ortalama
Can          NaN       NaN       NaN       NaN
Ayben  -0.205788       NaN -1.398898 -0.355799
Mehmet       NaN -1.615708 -1.415032 -0.610090
Ali    -0.741428       NaN       NaN       NaN

In [91]:
newDataFrame[newDataFrame>0]

        1. sinav  2. sinav  3. sinav  ortalama
Can     0.573057  0.834792  0.572092  0.659980
Ayben        NaN  0.537288       NaN       NaN
Mehmet  1.200471       NaN       NaN       NaN
Ali          NaN  1.343990  0.726644  0.443069

In [92]:
newDataFrame[newDataFrame["1. sinav"]>0]

        1. sinav  2. sinav  3. sinav  ortalama
Can     0.573057  0.834792  0.572092   0.65998
Mehmet  1.200471 -1.615708 -1.415032  -0.61009

## 5 - Chaging Index

In [94]:
newDataFrame

        1. sinav  2. sinav  3. sinav  ortalama
Can     0.573057  0.834792  0.572092  0.659980
Ayben  -0.205788  0.537288 -1.398898 -0.355799
Mehmet  1.200471 -1.615708 -1.415032 -0.610090
Ali    -0.741428  1.343990  0.726644  0.443069

In [95]:
newDataFrame.reset_index() # inplace=False btw

    index  1. sinav  2. sinav  3. sinav  ortalama
0     Can  0.573057  0.834792  0.572092  0.659980
1   Ayben -0.205788  0.537288 -1.398898 -0.355799
2  Mehmet  1.200471 -1.615708 -1.415032 -0.610090
3     Ali -0.741428  1.343990  0.726644  0.443069

In [110]:
newDataFrameIndex = ["Ca","Ay","Me","Al"]
newDataFrame["new index"] = newDataFrameIndex
newDataFrame

           1. sinav  2. sinav  3. sinav  ortalama new index
new index
Ca         0.573057  0.834792  0.572092  0.659980        Ca
Ay        -0.205788  0.537288 -1.398898 -0.355799        Ay
Me         1.200471 -1.615708 -1.415032 -0.610090        Me
Al        -0.741428  1.343990  0.726644  0.443069        Al

In [111]:
newDataFrame.set_index("new index", inplace=True) 
newDataFrame

           1. sinav  2. sinav  3. sinav  ortalama
new index
Ca         0.573057  0.834792  0.572092  0.659980
Ay        -0.205788  0.537288 -1.398898 -0.355799
Me         1.200471 -1.615708 -1.415032 -0.610090
Al        -0.741428  1.343990  0.726644  0.443069

In [112]:
newDataFrame.loc["Ca"]

1. sinav    0.573057
2. sinav    0.834792
3. sinav    0.572092
ortalama    0.659980
Name: Ca, dtype: float64

## 6 - Multi Index

In [115]:
firstIndex = ["Simpson","Simpson","Simpson","South Park", "South Park", "South Park"]

inIndex = [ "Homer", "Bart","Marge","Cartman", "Kenny","Kyle"]


unitedIndex = list(zip(firstIndex,inIndex))
unitedIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [119]:
birlesmisIndex = pd.MultiIndex.from_tuples(unitedIndex)
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [121]:
myList = [[40,"A"], [10, "B"], [30, "C"],[9,"D"],[10,"E"], [11,"F"]]
myListNP = np.array(myList)
myListNP

array([['40', 'A'],
       ['10', 'B'],
       ['30', 'C'],
       ['9', 'D'],
       ['10', 'E'],
       ['11', 'F']], dtype='<U11')

In [124]:
myDataFrame = pd.DataFrame(myListNP, index=birlesmisIndex, columns=["Yas","Meslek"])
myDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [125]:
myDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [126]:
myDataFrame.loc["South Park"].loc["Kyle"]

Yas       11
Meslek     F
Name: Kyle, dtype: object

In [128]:
myDataFrame.index.names = ["Film adi", "Isim"]
myDataFrame

                   Yas Meslek
Film adi   Isim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

## 7 - Operations | Empty cells

In [131]:
sozlukData = {"Istanbul":[30,29,np.nan], "Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukData)
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [133]:
havaDurumuDataFrame.dropna() # bos olan veri row'larin hepsini kaldirir

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [135]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [137]:
sozlukData2 = {"Istanbul":[30,29,np.nan], "Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
havaDurumuDataFrame2 = pd.DataFrame(sozlukData2)
havaDurumuDataFrame2

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [139]:
havaDurumuDataFrame2.dropna(axis=1, thresh=2) # 2 ve uzeri NaN'lari atar

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [141]:
havaDurumuDataFrame2.fillna(20) # na: bos veriler anlamina geliyor ve fillna ise boslari istedigimiz veri ile doldurmamiza yariyor

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## 8 - Operations | Group By

In [145]:
priceSozluk = {"Departman": ["Yazilim","Yazilim","Pazarlama","Pazarlama","HR","HR"],
               "Name": ["Can","Ayben","Burak","Mehmet","Umit","Ali"],
               "price": [100,200,300,400,500,600]
              }
priceDataFrame = pd.DataFrame(priceSozluk)
priceDataFrame

   Departman    Name  price
0    Yazilim     Can    100
1    Yazilim   Ayben    200
2  Pazarlama   Burak    300
3  Pazarlama  Mehmet    400
4         HR    Umit    500
5         HR     Ali    600

In [148]:
groupPrice = priceDataFrame.groupby("Departman")
groupPrice.count()

           Name  price
Departman
HR            2      2
Pazarlama     2      2
Yazilim       2      2

In [150]:
groupPrice.mean() # gruplardaki datalarin ortalamasi

           price
Departman
HR         550.0
Pazarlama  350.0
Yazilim    150.0

In [152]:
groupPrice.max() # grup icindeki en fazlasini verir, min() ise en azi

             Name  price
Departman
HR           Umit    600
Pazarlama  Mehmet    400
Yazilim       Can    200

In [154]:
groupPrice.describe() # gives some statics data

          price
          count   mean        std    min    25%    50%    75%    max
Departman
HR          2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
Pazarlama   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Yazilim     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0

## 9 - Operations | Concat or Concatenation

In [160]:
sozlukl = {"Isim" : ["Ahmet", "Mehmet","Zeynep","Atl"],
           "Spor" : ["Kosu", "Yuzme", "Kosu", "Basketbol"],
          "Kalori" : [100,200,300,400]
          }

dataFrame1= pd.DataFrame(sozlukl)

dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     300
3    Atl  Basketbol     400

In [164]:
sozluk2 = {"Isim" : ["Osman", "Levent", "Atlas", "Fatma" ],
           "Spor" : ["Kosu", "Yuzme", "Kosu", "Basketbol"],
           "Kalori" : [200,100,50,300]}

dataFrame2= pd.DataFrame(sozluk2)
dataFrame2

     Isim       Spor  Kalori
0   Osman       Kosu     200
1  Levent      Yuzme     100
2   Atlas       Kosu      50
3   Fatma  Basketbol     300

In [167]:
sozluk3 = {"Isim" : ["Ayse","Mahmut","Duygu", "Nur"],
           "Spor" : ["Kosu", "Yuzme", "Futbol", "Gures"],
          "Kalori" : [300,400,500,250]
          }
dataFrame3 = pd.DataFrame(sozluk3)
dataFrame3

     Isim    Spor  Kalori
0    Ayse    Kosu     300
1  Mahmut   Yuzme     400
2   Duygu  Futbol     500
3     Nur   Gures     250

In [168]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     300
3    Atl  Basketbol     400
0   Osman       Kosu     200
1  Levent      Yuzme     100
2   Atlas       Kosu      50
3   Fatma  Basketbol     300
0    Ayse       Kosu     300
1  Mahmut      Yuzme     400
2   Duygu     Futbol     500
3     Nur      Gures     250

In [169]:
pd.concat([dataFrame1,dataFrame2,dataFrame3], axis=1)

,Isim,Spor,Kalori,Isim,Spor,Kalori,Isim,Spor,Kalori
0,Ahmet,Kosu,100,Osman,Kosu,200,Ayse,Kosu,300
1,Mehmet,Yuzme,200,Levent,Yuzme,100,Mahmut,Yuzme,400
2,Zeynep,Kosu,300,Atlas,Kosu,50,Duygu,Futbol,500
3,Atl,Basketbol,400,Fatma,Basketbol,300,Nur,Gures,250

## 10 - Operations | Merge

In [174]:
sozluk1 = {"Isim" : ["Ahmet", "Mehmet","Zeynep","Atl"],
           "Spor" : ["Kosu", "Yuzme", "Kosu", "Basketbol"],
          }
dataFrame1 = pd.DataFrame(sozluk1)

sozluk1_1 = {"Isim" : ["Ahmet", "Mehmet","Zeynep","Atl"],
             "Kalori" : [100,200,300,400]
            }

dataFrame1_1 = pd.DataFrame(sozluk1_1)

dataFrame1

     Isim       Spor
0   Ahmet       Kosu
1  Mehmet      Yuzme
2  Zeynep       Kosu
3    Atl  Basketbol

In [176]:
dataFrame1_1

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     300
3    Atl     400

In [177]:
mergedDataFrame = pd.merge(dataFrame1,dataFrame1_1) # ayni column'lari tekrarlamadan birlestirme islemi yapar
mergedDataFrame

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     300
3    Atl  Basketbol     400

In [178]:
mergedDataFrame2 = pd.merge(dataFrame1,dataFrame1_1,on="Isim")
mergedDataFrame2

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     300
3    Atl  Basketbol     400

## 11 - Advanced Oparations

In [182]:
maasSozluk= {"Isim" : ["Atil","Zeynep","Mehmet", "Ahmet"],
             "Departman" : ["Yazilim","Sati","Pazarlama", "Yazilim"],
             "Maas" : [200,300,400,500]
            }

maasDataFrame = pd.DataFrame(maasSozluk)
maasDataFrame

     Isim  Departman  Maas
0    Atil    Yazilim   200
1  Zeynep      Sati   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazilim   500

In [183]:
maasDataFrame["Departman"].unique()

array(['Yazilim', 'Sati', 'Pazarlama'], dtype=object)

In [187]:
maasDataFrame["Departman"].nunique() # number of unique

3

In [188]:
maasDataFrame["Departman"].value_counts()

Yazilim      2
Sati        1
Pazarlama    1
Name: Departman, dtype: int64

In [191]:
def bruttenNete(maas):
    return maas * 0.66
maasDataFrame["Maas"]

0    200
1    300
2    400
3    500
Name: Maas, dtype: int64

In [192]:
maasDataFrame["Maas"].apply(bruttenNete) # her satira apply eder

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [193]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [199]:
yeniBirveri = {"Karakter Sinifi" : ["South Park", "South Park", "Simpson", "Simpson", "Simpson"],
               "Karakter Ismi" : ["Cartman", "Kenny", "Homer", "Bart", "Bart"],
               "Karakter Yas" : [9,10,50,20,31]
               }

karakterDF = pd.DataFrame(yeniBirveri)
karakterDF

  Karakter Sinifi Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            31

In [202]:
karakterDF.pivot_table(values="Karakter Yas", index=["Karakter Sinifi","Karakter Ismi"], aggfunc=np.sum) # default olarak ortalama aliyor ama aggfunc ile fonksiyonu degistirebiliriz

                               Karakter Yas
Karakter Sinifi Karakter Ismi
Simpson         Bart                     51
                Homer                    50
South Park      Cartman                   9
                Kenny                    10